misurazioni/misurazioni artillery/artillery-discount-rest.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 5
  payload:
    path: "products.csv"
    fields:
      - productId
      - oldPrice
      - newPrice
  defaults:
    headers:
scenarios:
  - name: Applica sconto a prodotto low stock
    flow:
      - patch:
          url: "/products/{{ productId }}"
          json:
            price: "{{ newPrice }}"
      - think: 1